<a href="https://colab.research.google.com/github/lalitha7571/Assignments/blob/master/datacleaningassignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [ ]:
df['FlightNumber']

0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: FlightNumber, dtype: float64

In [ ]:
newindex = np.arange(1,df.From_To.count()+1)
newindex
df.set_index(newindex,inplace=True)
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN           NaN            []    <Air France> (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis           NaN          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [ ]:
for i in np.arange(1,df.From_To.count()+1):
  if pd.isnull(df.FlightNumber.loc[i,]):
    df.loc[i,'FlightNumber'] = df.FlightNumber.loc[i-1,] + 10
df['FlightNumber']
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN       10055.0            []    <Air France> (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis       10075.0          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [ ]:
df['FlightNumber'].astype(int)

1    10045
2    10055
3    10065
4    10075
5    10085
Name: FlightNumber, dtype: int64

In [ ]:
df['From_To']

1        LoNDon_paris
2        MAdrid_miLAN
3    londON_StockhOlm
4      Budapest_PaRis
5     Brussels_londOn
Name: From_To, dtype: object

In [ ]:
temporarydf = df.copy()

temporarydf[['From','To']] = temporarydf.From_To.str.split("_",expand=True)

temporarydf

            From_To  FlightNumber  ...      From         To
1      LoNDon_paris       10045.0  ...    LoNDon      paris
2      MAdrid_miLAN       10055.0  ...    MAdrid      miLAN
3  londON_StockhOlm       10065.0  ...    londON  StockhOlm
4    Budapest_PaRis       10075.0  ...  Budapest      PaRis
5   Brussels_londOn       10085.0  ...  Brussels     londOn

[5 rows x 6 columns]

In [ ]:
temporarydf.From = temporarydf.From.str.capitalize()
temporarydf.To = temporarydf.To.str.capitalize()
temporarydf.From_to = temporarydf.From_To.str.capitalize()

print(temporarydf)

            From_To  FlightNumber  ...      From         To
1      LoNDon_paris       10045.0  ...    London      Paris
2      MAdrid_miLAN       10055.0  ...    Madrid      Milan
3  londON_StockhOlm       10065.0  ...    London  Stockholm
4    Budapest_PaRis       10075.0  ...  Budapest      Paris
5   Brussels_londOn       10085.0  ...  Brussels     London

[5 rows x 6 columns]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  This is separate from the ipykernel package so we can avoid doing imports until

In [ ]:
df

            From_To  FlightNumber  RecentDelays              Airline
1      LoNDon_paris       10045.0      [23, 47]               KLM(!)
2      MAdrid_miLAN       10055.0            []    <Air France> (12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
4    Budapest_PaRis       10075.0          [13]       12. Air France
5   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [ ]:
df.drop('From_To',axis=1,inplace=True)
df

   FlightNumber  RecentDelays              Airline
1       10045.0      [23, 47]               KLM(!)
2       10055.0            []    <Air France> (12)
3       10065.0  [24, 43, 87]  (British Airways. )
4       10075.0          [13]       12. Air France
5       10085.0      [67, 32]          "Swiss Air"

In [ ]:
df['From_To'] = temporarydf['From_To']
df

            From_To  FlightNumber              Airline  Delay1  Delay2  Delay3
0               NaN       10045.0               KLM(!)    23.0    47.0     NaN
1      LoNDon_paris           NaN    <Air France> (12)     NaN     NaN     NaN
2      MAdrid_miLAN       10065.0  (British Airways. )    24.0    43.0    87.0
3  londON_StockhOlm           NaN       12. Air France    13.0     NaN     NaN
4    Budapest_PaRis       10085.0          "Swiss Air"    67.0    32.0     NaN

In [ ]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

rows = [] 
df.apply(lambda row:[rows.append([row['Airline'], row['FlightNumber'],nn,row['From_To']]) for nn in row.RecentDelays], axis=1)
rows

[['KLM(!)', 10045.0, 23, 'LoNDon_paris'],
 ['KLM(!)', 10045.0, 47, 'LoNDon_paris'],
 ['(British Airways. )', 10065.0, 24, 'londON_StockhOlm'],
 ['(British Airways. )', 10065.0, 43, 'londON_StockhOlm'],
 ['(British Airways. )', 10065.0, 87, 'londON_StockhOlm'],
 ['12. Air France', nan, 13, 'Budapest_PaRis'],
 ['"Swiss Air"', 10085.0, 67, 'Brussels_londOn'],
 ['"Swiss Air"', 10085.0, 32, 'Brussels_londOn']]

In [ ]:
df_new = pd.DataFrame(rows,columns=df.columns)
df_new

               From_To  FlightNumber  RecentDelays           Airline
0               KLM(!)       10045.0            23      LoNDon_paris
1               KLM(!)       10045.0            47      LoNDon_paris
2  (British Airways. )       10065.0            24  londON_StockhOlm
3  (British Airways. )       10065.0            43  londON_StockhOlm
4  (British Airways. )       10065.0            87  londON_StockhOlm
5       12. Air France           NaN            13    Budapest_PaRis
6          "Swiss Air"       10085.0            67   Brussels_londOn
7          "Swiss Air"       10085.0            32   Brussels_londOn

In [ ]:
df3 = pd.DataFrame(df['RecentDelays'].values.tolist())
df3

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [ ]:
length_cols = df3.shape[1]
length_cols

3

In [ ]:
col_list = []
col_dict ={}

for i in range(length_cols):
  Key = df3.columns[i]
  Value = "Delay" + str(i+1)
  col_dict[Key] = Value

col_dict

{0: 'Delay1', 1: 'Delay2', 2: 'Delay3'}

In [ ]:
df3.rename(columns = col_dict,inplace=True)
df3

   Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [ ]:
df[['Delay1','Delay2','Delay3']] = df3[['Delay1','Delay2','Delay3']]

In [ ]:
df

            From_To  FlightNumber  RecentDelays  ... Delay1  Delay2  Delay3
0      LoNDon_paris       10045.0      [23, 47]  ...   23.0    47.0     NaN
1      MAdrid_miLAN           NaN            []  ...    NaN     NaN     NaN
2  londON_StockhOlm       10065.0  [24, 43, 87]  ...   24.0    43.0    87.0
3    Budapest_PaRis           NaN          [13]  ...   13.0     NaN     NaN
4   Brussels_londOn       10085.0      [67, 32]  ...   67.0    32.0     NaN

[5 rows x 7 columns]

In [ ]:
df.drop('RecentDelays',inplace=True,axis=1)
df

            From_To  FlightNumber              Airline  Delay1  Delay2  Delay3
0      LoNDon_paris       10045.0               KLM(!)    23.0    47.0     NaN
1      MAdrid_miLAN           NaN    <Air France> (12)     NaN     NaN     NaN
2  londON_StockhOlm       10065.0  (British Airways. )    24.0    43.0    87.0
3    Budapest_PaRis           NaN       12. Air France    13.0     NaN     NaN
4   Brussels_londOn       10085.0          "Swiss Air"    67.0    32.0     NaN